[{"id":1,"service_title":"HOME NURSING CARE","short_desc":"Home nursing services encompasses a wide range of healthcare services that can be easily administered at your home. Home care nursing services are usually cheaper than hospitals and nursing homes","service_desc":"Home nursing services encompasses a wide range of healthcare services that can be easily administered at your home. Home care nursing services are usually cheaper than hospitals and nursing homes, while being just as effective as the medical care offered in a hospital or nursing home.An in-home nursing service offers personalized nursing care at home as offered in a typical hospital while being more compassionate towards the patient and gets integrated into the patient’s family and develops an emotional bond with the patient and their family.The services offered by home care nursing are provided by registered nurses, physiotherapists and occupational therapists among others. And as such you need not worry on the quality of service offered by the home nurse.In the past, the phrases In-Home Care, Home Care and Home Health Care were used interchangeably. Today however, people have developed a better understanding towards Home Health Care or In-Home nursing service which is basically skilled nursing care whereas the term In-Home Care refers to non-medical care services like personal care and companionship and supervision.When Do You Need Us?The main goal of home nursing service is to treat an illness or injury. The home nursing services usually entails wound care for pressure sores or surgical wound, patient and care – giver education, Intravenous or nutrition therapy, injections, rehabilitation therapies and monitoring serious illness and unstable health status.","service_img":"https://i.ibb.co/mhC1Nhg/health-care-services-500x500.jpg"},
{"id":2,"service_title":"BABY CARE SUPPORT","short_desc":"Baby Care Support in Dhaka Bangladesh otherwise known as day care, is the care and supervision of a child or multiple children at a time, whose ages range from six weeks to thirteen years.","service_desc":"Baby Care Support in Dhaka Bangladesh otherwise known as day care, is the care and supervision of a child or multiple children at a time, whose ages range from six weeks to thirteen years. New Home Born Baby Care is the action or skill of looking after children by a day-care center, nannies, babysitter, teachers or other providers. Child care is a broad topic that covers a wide spectrum of professionals, institutions, contexts, activities, and social and cultural conventions.Early child care is an equally important and often overlooked component of . Child care providers can be children’s first teachers, and therefore play an integral role in systems of . Quality care from a young age can have a substantial impact on the future successes of children. The main focus of childcare is on the development of the child, whether that be mental, social, or psychological.New Home Born Baby Care Support in Dhaka Bangladesh (BD),In most cases children are taken care of by their parents, legal guardians, or siblings. In some cases, it is also seen that children care for other children. This informal care includes verbal direction and other explicit training regarding the child’s behavior, and is often as simple as “keeping an eye out” for younger siblings. Care facilitated by similar-aged children covers a variety of developmental and psychological effects in both caregivers and charge. This is due to their mental development being in a particular case of not being able to progress as it should be at their age. This care giving role may also be taken on by the child’s .Another form of childcare that is on the rise in contrast to familial caregiving is that of center-based child care. In lieu of familial care giving, these responsibilities may be given to paid caretakers,  or  to provide care, housing, and schooling.Professional caregivers work within the context of a center-based care (including creches, ,  and schools) or a home-based care ( or family daycare). The majority of child care institutions that are available require that child care providers to have extensive training in  and be  certified. In addition, ,  at all centers, and are normally a requirement. Child care can consist of advanced learning environments that include  or . The objective of the program of daily activities should be to foster incremental developmental progress in a healthy and safe environment and should be flexible to capture the interests of the children and the individual abilities of the children.In many cases the appropriate child care provider is a teacher or personal with educational background in child development, which requires a more focused training aside from the common core skills typical of a child caregiver.","service_img":"https://i.ibb.co/VqBBC6R/daytime-baby-care.png"},
{"id":3,"service_title":"GERIATRIC SENIOR CARE","short_desc":"Home Elderly Care,One of the aims of elderly care is to help elderly people and those with disabilities live normal, independent lives. This includes living in their own homes as long as possible.","service_desc":"Home Elderly Care,One of the aims of elderly care is to help elderly people and those with disabilities live normal, independent lives. This includes living in their own homes as long as possible.Elderly Home Patient Cares are trained yet affordable to take care of your loved ones specially who require assistance with various daily living activities. Our Caregivers can facilitate with the client’s hygiene demand, assist with mobilization, facilitate with feeding.They’re going to conjointly play a job in promoting the mental state of the consumer by occupying them with numerous activities once they are awake and up to it.Home Nursing Care Service in Dhaka Bangladesh (bd), One of the aims of elderly care is to help elderly people and those with disabilities live normal, independent lives. This includes living in their own homes as long as possible.Elderly living alone Loneliness can be twice as unhealthy as obesity. Feeling of isolation can have a devastating impact on an older person.Elderly need Personal assistanceAssistance in daily living activity like bathing, toileting, getting dressed up, feeding, walking etc. Elderly may or may not be in a bedridden/semi bedridden state.Suffering from old age disease:It becomes a great challenge to manage the elderly with disease like Alzheimer, Parkinson, dementia, osteoarthritis etc.Transportation services,The elderly and disabled also qualify for transportation services in taxis or specially adapted vehicles. This option is available to those who are unable to travel by regular public transport. Home Nursing Care Service in Dhaka Bangladesh (bd),provide this service to you.","service_img":"https://i.ibb.co/cr2FtwL/home-care2.png"},
{"id":4,"service_title":"Ambulance Service","short_desc":"Our lives are valuable. It is important to get ambulance service in the country, especially all parts of Dhaka. As Dhaka is the busiest and most crowded city,s","service_desc":"Our lives are valuable. It is important to get ambulance service in the country, especially all parts of Dhaka. As Dhaka is the busiest and most crowded city, traffic makes it nearly impossible to reach destination, i.e. hospital or home. Our teams are expert enough to beat the traffic and reach to the patients’ home or to the hospital in a timely manner. You may feel comfortable about our arrangement as all the ambulances are full-furnished with necessary equipment, oxygen cylinders, wheel chairs, stretchers. Each ambulance has a neat and clean bed for the patients. There are comfortable seats for the companions of the patients. We are ready providing you the suitable ambulance service from one district to another.We provide different types of ambulance. There are mainly – AC ambulance, non-AC ambulance, freezer van ambulance, ICU ambulance, NICU ambulance and air ambulance. We provide ambulance according to your need and patient’s condition. However, the basic ambulance we provide is non-AC ambulance which is cheap and cost effective. The rent of other types of ambulance we provide is cheap too. Be sure that, you get the right type of ambulance in cheaper price and in quickest possible time. It saves time, money, energy and above all a valuable life. Follow this simple process: – Call our number, get the ambulance and get to the hospital; or grab your phone and call the number to get the ambulance and reach home.","service_img":"https://i.ibb.co/T1CwKpv/Doctors-Home-BD-Ambulance-feature-image.jpg"},
{"id":5,"service_title":"CRITICAL CARE NURSING","short_desc":"Our home care nursing services provide support for people in many ways ranging from a one hour visit to 24 hour live-in care visiting nurse.","service_desc":"Our home care nursing services provide support for people in many ways ranging from a one hour visit to 24 hour live-in care. We provide on demand visiting nurses, personal or private nurse at home or in hospital to take care of patient with highest level of satisfaction.  From the moment our nursing staff walk into a patient's life they are there to help support them physically, emotionally and mentally. Each client is assigned their own carefully screened caregiver based on their needs and care plan evaluation. Our specialized nursing team provides acute home care to patients with multiple medical challenges.","service_img":"https://i.ibb.co/2Wy7Stz/Critical-care-nursing-courses-in-Punjab.jpg"},
{"id":6,"service_title":"Eye Care","short_desc":"At Primary Eyecare Associates, we are committed to providing the best care in our area, offering a professional a welcoming environment.","service_desc":"At Primary Eyecare Associates, we are committed to providing the best care in our area, offering a professional a welcoming environment. Our comprehensive eye care services include complete and thorough eye exams, checking for visual acuity and diseases such as cataracts and glaucoma. We also offer a great optical department where you can find the perfect pair of glasses or contact lenses for you!","service_img":"https://i.ibb.co/pn8kYZP/eye-care-services.jpg"}]